Repository: EBRD-ProzorroSale/openprocurement.schemas.dgf
Catalog: docs/source/locale/*/LC_MESSAGES/create_06_schema.po
Languages: uk

source: Create new schema for 06*****
uk: Створення схеми для патерну 06*****

source: Schema fields table.
uk: Таблиця з полями, для майбутньої схеми.

source: For schema with pattern 06***** we need fields:
uk: Необхідні поля для схеми.

source: Create template using `SchemaOnline <http://jsonschema.net/>`_. Paste fields, and generate template for schema.
uk: Створемо шаблон за допомогою сервісу `SchemaOnline <http://jsonschema.net/>`_.Опишемо поля, та згенеруємо шаблон.

source: Edit template
uk: Редагування шаблону

source: Now we can add validation, description, and default value for every field.
uk: Тепер додамо валідацію, опис та значення за замовчуванням для кожного поля.

source: We got such a scheme.
uk: Отримаємо таку схему.

source: Add ID
uk: Додамо ID.

source: Patter for schema is 06*****, so ID must have look **file:///schemas/06/schema_001.json**
uk: ID повинно мати вигляд **file:///schemas/06/schema_001.json**

source: Create schema for 061****
uk: Створення схеми для 061****

source: We can see that 061***** template have only 1 unique field. We can inherit rest fields from parent schema.
uk: Схем з кодом 061**** повинна мати всі поля що й 06*****. Тому всі поля наслідуємо, та описуємо одне додаткове.

source: Copy previous schema, edit fields, add one more, and edit ID.
uk: Скопіюємо батьківську схему, відредагуємо поля, додамо нове, та оновимо ID.

source: Updated schema.
uk: Оновлена схема.

source: Template which we got on previous step
uk: Шаблон, який ми отримали на попередньому кроці.
