Repository: EBRD-ProzorroSale/openprocurement.schemas.dgf
Catalog: docs/source/locale/*/LC_MESSAGES/create_new_schema.po
Languages: uk

source: Create new schema
uk: Створення нової схеми

source: For creating new schema first create template on `SchemaOnline <http://jsonschema.net/>`_.
uk: Для нової схеми потрібно створити шаблон `SchemaOnline <http://jsonschema.net/>`_.

source: Example setup for service.
uk: Приклад налаштування сервісу

source: Create schema.
uk: Створити схему

source: Pattern for new schema 06******-*, it's means that all items with CAV classification which start with 06 and have't more specific schema will use it.
uk: Патерн для нової схеми 06******-*, отже всі items, які матимуть CAV класифікатор которий починається з 06, будуть використовувати схему.

source: Fields for new schema:
uk: Поля для нової схеми, з можливими даними:

source: So, open service and write your fields, and then get template.
uk: Відкриємо сервіс та опишемо наші поля у json.

source: Generate schema template and save it in file, with name `schema_XXX.json` where XXX - is number of version.
uk: Створемо шаблон схеми, та збережемо його в файлі з назвою `schema_XXX.json`, де XXX - це номер версії схеми.

source: Edit template which we create before. Open file with schema and edit fields `title`, and `description`.
uk: Відреагуємо шаблон, який був створений на попередньому етапі. Поля, які потрібно відредагувати `title` и `description`

source: Validation
uk: Валідація

source: For every field we can add basic validation, like `maxlength` - max length for text field or `minlength`. For more validation you can read `this <http://json-schema.org/latest/json-schema-validation.html#rfc.section.5/>`_.
uk: Для кожного поля є можливість додати валідацію, наприклад `maxlength` - встановлення максимальної довжини рядка. Перелік можливої валідації можно знайти в `документації <http://json-schema.org/latest/json-schema-validation.html#rfc.section.5/>`_.

source: Change ID for schema
uk: Редагування ID для схеми.

source: For editing main ID in schema get real number from schema pattern and then insert after every number '/', exception is only first two symbols.
uk: Для редагування ID схеми, потрібно розділи номер схеми, починаючи з другого, символом `/`.

source: **001** - Number schema version, set real number.
uk: **001** - Номер версії схеми.

source: Examples:
uk: Приклади:

source: Schema ID
uk: ID Схеми

source: Relative schema fields
uk: Успадковані поля схеми

source: Pattern
uk: Шаблон

source: Edit schema template
uk: Редагувати шаблон схеми

source: Example you have schema by pattern 06******-*, and want create for 061*****-*. They both have common fields `region`, `city`, `availability_owners` in our case.
uk: Наприклад маємо схему за патерном 06******-*, та хочемо створити 061*****-*.Вони мають спільні поля `region`, `city`, та `availability_owners`.

source: Create schema 061*****-* but specify only one field `ownership_of_land`, the rest import from parent schema schemas/06/schema_001.json
uk: Створемо схему 061*****-*, опишемо поле `ownership_of_land`, інші наслідуємо з батьківської схеми.
